---
kind: property
id: P:Autodesk.Revit.DB.Electrical.TemperatureRatingType.InsulationTypes
source: html/5cdebb2b-28d5-c269-77a9-88397ec71ab8.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingType.InsulationTypes Property

Get all insulation types defined in this temperature rating type and its corresponding material type.

## Syntax (C#)
```csharp
public InsulationTypeSet InsulationTypes { get; }
```